VALIDATION_MESSAGES = {
    'ERRORS' : {
        'REQUIRED'          : 'Παρακαλώ συμπλήρωσε όλα τα απαιτούμενα πεδία',
        'EMAIL'             : 'Το email που έδωσες είναι λάθος',
        'LENGTH'            : {
            'MIN'       : 'Η απάντησή σου είναι μικρότερη από ##n## χαρακτήρες',
            'MAX'       : 'Η απάντησή σου είναι μεγαλύτερη από ##n## χαρακτήρες',
            'RANGE'     : 'Η απάντησή σου πρέπει να είναι ##min## - ##max## χαρακτήρες'
        },
        'INTERNATIONAL'     : 'Η απάντησή σου δεν πρέπει να περιέχει ελληνικούς χαρακτήρες',
        'ILLEGAL'           : {
            'CHARS' : 'Η απάντησή σου περιέχει μη αποδεκτούς χαρακτήρες'
        },
        'PASSWORD'          : 'Ο κωδικός σου δεν είναι αρκετά δυνατός',
        'NOTCONFIRMED'      : 'Δεν έχει επιβεβαιωθεί',
        'IP'                : {
            //'UNRECOGNISED_IP_VERSION'   : 'Η έκδοση της IP που προσπαθείς να καταχωρίσεις δεν μπορεί να αναγνωριστεί',
            //'LOCAL_IP'                  : 'Η IP δεν μπορεί να είναι του τοπικού δικτύου σου',
            'INVALID_CHARS'             : 'Η IP που δήλωσες περιέχει μη αποδεκτούς χαρακτήρες',
            'INVALID_SYNTAX'            : 'Η IP που δήλωσες δεν έχει συνταχθεί σωστά',
            'INVALID_FORMAT'            : 'Η IP πρέπει να είναι της μορφής 0.0.0.0, με αριθμούς από το 0 ως το 255',
            'INVALID_FORMAT_V6'         : 'Η IP πρέπει να είναι της μορφής 0000:0000:0000:0000:0000:0000:0000:0000, με αριθμούς από το 0 ως το 255 και χαρακτηρες A ως F',
            'TOO_BIG_NUMS'              : 'Η IP δεν μπορεί να περιέχει αριθμούς μεγαλύτερους από 255',
            'NO_IP'                     : 'Δεν βρέθηκε IP'
        },
        'NAME_SERVERS'      : {
            'INVALID_CHARS'             : 'Ο nameserver που θέλεις να αποθηκεύσεις περιέχει μη αποδεκτούς χαρακτήρες.',
            'INVALID_SYNTAX'            : 'Ο nameserver που θέλεις να αποθηκεύσεις περιέχει συντακτικά λάθη.',
            'HOST_INVALID_FORMAT'       : 'Ο nameserver που θέλεις να αποθηκεύσεις πρέπει να είναι της μορφής xxx.##fqdn##.',
            'TOO_BIG_PREFIX'            : 'Το πρόθεμα του Nameserver που θέλεις να αποθηκεύσεις δεν μπορεί να είναι μεγαλύτερο από ##limit## χαρακτήρες.',
            'PREFIX_NO_PERIODS'         : 'Το πρόθεμα του nameserver που θέλεις να αποθηκεύσεις δεν μπορεί να περιέχει τελείες',
            'INVALID_HOST_ID'           : 'Ο nameserver που θέλεις να αποθηκεύσεις μπορεί να περιέχει "-", μόνο μεταξύ δύο λέξεων.',
            'INVALID_NAMESERVER_DOMAIN' : 'Ο nameserver που θέλεις να αποθηκεύσεις πρέπει να είναι της μορφής ns1.google.com',
            'UNACCEPTABLE_DOMAIN'       : 'Ο nameserver που θέλεις να αποθηκεύσεις δεν είναι αποδεκτός',
        },
        'UNIQUE'            : 'Αυτή η τιμή δεν είναι μοναδική',
        'CONTACT_PROFILES'  : {
            'MISSING' : 'Αυτό το πρόσωπο έχει ελλιπή στοιχεία. Παρακαλώ συμπλήρωσέ τα!'
        },
        'NOCHANGES'         : 'Δεν έκανες κάποια αλλαγή.',
        'ASCII'             : 'Σε αυτό το πεδίο επιτρέπονται μόνο ΑSCII χαρακτήρες.',
        'NUMERIC'           : 'Η τιμή πρέπει να είναι αριθμός',
        'VALUES'            : {
            'MIN'   :  'Η τιμή δεν μπορεί να είναι μικρότερη από ##min##',
            'MAX'   :  'Η τιμή δεν μπορεί να είναι μεγαλύτερη από ##max##'
        },
        'CUSTOM'            : {
            'WHOIS' : {
                'POSTKEYWORD' : {
                    'REQUIRED': 'Παρακαλώ εισήγαγε το domain που θες να αναζητήσεις',
                    'LENGTH': {
                        'MIN': 'Ένα domain δε μπορει να είναι μικρότερο από ##n## χαρακτήρες',
                    },
                }
            }
        }
    }
};